{
    "entries": [
        {
            "id": 1,
            "date": "Jan 17, 2026 — 02:41 AM",
            "blocks": [
                {
                    "type": "text",
                    "content": "Diary — Week 1\nDate: Jan 17, 2026\nStarted at: 2:41 AM\nLocation: my room, lights off, laptop on\n\nI woke up again. Not a good morning woke up. More like my eyes opened and my brain was already running. It's night. Obviously.\nI opened my laptop. Because honestly… what else am I gonna do? No plans. No checklist. Just me and the screen.\n\n[2:44 AM]\nMusic on. Always music first. Without music the silence gets too loud.\n\nMade coffee. Needed coffee. Without coffee I'm just… fine fucked. I need coffee every time — studying, after dinner, after breakfast, randomly existing. Morning routine is coffee. Night routine is also coffee."
                },
                {
                    "type": "image",
                    "imagePath": "/diary/week1_desk.jpg",
                    "side": "left"
                },
                {
                    "type": "text",
                    "content": "note to self: stop pretending coffee isn't a problem.\n\nGym is still stopped because of my hand surgery. Actually surgeries — two of them. My hand is like 70% okay now, but still not fully there.\nI miss calisthenics badly. Like badly.\n\n[2:51 AM]\nRandom thought: I miss being tired in a good way.\n\nThat routine was something else. College → gym → home. Mind completely focused. No noise. No overthinking.\nI even learned handstand back then. Crazy to think about now.\n\nBeen working on this website again. Tweaking small stuff. Moving things around. One pixel here, one pixel there.\nFor some reason it makes me feel alive. Idk why, but it does."
                },
                {
                    "type": "image",
                    "imagePath": "/diary/week1_vertical.jpg",
                    "side": "right"
                },
                {
                    "type": "text",
                    "content": "side thought: maybe this is what control feels like.\n\nNot really going deep into AI stuff right now, but I wanna explore that too. I think I'm becoming more nerdy lately. Which is funny because I never planned that. It just… happened.\n\n[3:02 AM]\nCold is getting worse. Fingers kinda numb.\n\nThis weekend we had a bonfire. Burned stuff. Sat around. Talked nonsense. Good vibes.\nBut god, the weather. It's so cold. Like unnecessarily cold.\n\nSometimes it hits me that it's almost four years here. College is gonna end.\nThat thought sits heavy when the room gets quiet.\n\nnote: I really don't want this chapter to end.\n\nI really wish I had a camcorder. Like genuinely. I should've had one from the start.\nCould've recorded everything. Not for posting. Just for me."
                },
                {
                    "type": "image",
                    "imagePath": "/diary/week1_wall.jpg",
                    "side": "left"
                },
                {
                    "type": "text",
                    "content": "[3:11 AM]\nWhy do regrets hit harder at night?\n\nI watch these YouTube channels — people building personal websites, documenting their lives. And I'm like yeah… I should start something like that too.\nBut then placements.\n\nGet placed. Secure life. Job. Money. Adult things.\nI want that too. I really do.\n\nunfinished thought: what if I lose myself doing that…\n\nRight now I live with my friends in a flat. I have my own room. Everything's kinda nice. Chill. Normal. Way better than hostel life.\n\n[3:19 AM]\nSomeone just laughed in the next room. Made me smile.\n\nI don't want this phase to end. At the same time I know it will. Graduation is gonna hit hard.\nI keep telling my friends to study — half joking, half serious.\n\nnote: hope we all make it together.\n\nAlso yeah. Still cold. Again.\n\nBought some posters recently. Almost forgot.\nEarlier I had this huge Gojo Satoru poster. Looked cool but felt too loud.\nSmaller posters feel… more me.\n\n[3:27 AM]\nWall looks good now. That matters more than it should.\n\nI really want to ride a bike. But I don't have one. And that sucks.\nI don't have a lot of things, but not having a bike hurts more than it should.\n\nplan (maybe): buy one after first salary.\n\nFor now, I'll just keep working on this website. Slowly. No rush.\nBackend can wait.\n\n[3:33 AM]\nMusic still playing. Brain tired.\n\nEnding this here before I start typing nonsense……\n(or maybe this whole thing already is)"
                }
            ]
        }
    ]
}